kb1c/src/Catalogs/ПользователиБазыЗнаний/ПользователиБазыЗнаний.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ПользователиБазыЗнаний</name>
  <predefined>
    <items>
      <name>НеАвторизован</name>
      <description>Не авторизован</description>
    </items>
  </predefined>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидПользователя</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Имя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Пароль</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>НастройкиПрав</name>
    <attributes>
      <name>Право</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

kb1c/src/Catalogs/ПользователиБазыЗнаний/Forms/ФормаЭлемента/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// УПРАВЛЕНИЕ ФОРМОЙ

&НаКлиенте
Процедура УстановитьВидимость()
	Элементы.Пользователь.Видимость = (Объект.ВидПользователя = 0);
	Элементы.Имя.Видимость			= (Объект.ВидПользователя = 1);
	Элементы.Пароль.Видимость		= (Объект.ВидПользователя = 1);
КонецПроцедуры

&НаКлиенте
Процедура ПользовательПриИзменении(Элемент)
	Объект.Наименование = Строка(Объект.Пользователь);
КонецПроцедуры

&НаКлиенте
Процедура ИмяПриИзменении(Элемент)
	Объект.Наименование = СокрЛП(Объект.Имя);
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТКА СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ

&НаКлиенте
Процедура ВидПользователяПриИзменении(Элемент)
	Если Объект.ВидПользователя = 0 Тогда
		Объект.Имя		= "";
		объект.Пароль	= "";
	ИначеЕсли Объект.ВидПользователя = 1 Тогда
		Объект.Пользователь = Неопределено;
	КонецЕсли;
	
	УстановитьВидимость();
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТКА СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Объект.Предопределенный Тогда
		ЭтотОбъект.ТолькоПросмотр = Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьВидимость();
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТКА КОМАНД ФОРМЫ

////////////////////////////////////////////////////////////////////////////////
// ОБЩИЕ МЕТОДЫ
